local M = {}
M.maxLevels = 9
M.modeAlphabet = {}
M.modeAlphabet['romaji'] ={}
M.modeAlphabet['hiragana'] ={}
M.modeAlphabet['katakana'] ={}

local loadsave = require("loadsave")
if loadsave.fileExists("japanese-word-search.json", system.DocumentsDirectory) then
    saveDataTable = loadsave.loadTable("japanese-word-search.json")
else
    saveDataTable={}
    saveDataTable['romaji']={}
    saveDataTable['hiragana']={}
    saveDataTable['katakana']={}
    saveDataTable['romaji'].unlockedLevels =1
    saveDataTable['hiragana'].unlockedLevels = 1
    saveDataTable['katakana'].unlockedLevels =1
    loadsave.saveTable(saveDataTable, "japanese-word-search.json")
end

saveDataTable = loadsave.loadTable("japanese-word-search.json")
M.modeAlphabet['romaji'].unlockedLevels =saveDataTable['romaji'].unlockedLevels
M.modeAlphabet['hiragana'].unlockedLevels =saveDataTable['hiragana'].unlockedLevels
M.modeAlphabet['katakana'].unlockedLevels =saveDataTable['katakana'].unlockedLevels


M.modeAlphabet['romaji'].alphabet = {'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'}
M.modeAlphabet['hiragana'].alphabet = {'あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'が', 'ぎ', 'ぐ', 'げ', 'ご', 'さ', 'し', 'す', 'せ', 'そ',
    'ざ','じ', 'ず', 'ぜ', 'ぞ', 'た', 'ち','つ','て','と','だ','ぢ','づ','で','ど','な','に','ぬ','ね','の','は','ひ','ふ','へ','ほ','ば','び','ぶ','べ','ぼ',
    'ぱ','ぴ','ぷ','ぺ','ぽ','ま','み','む','め','も','や','ゆ','よ','ら','り','る','れ','ろ','わ','を','ん',
}

M.modeAlphabet['katakana'].alphabet = {'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ', 'ク', 'ケ', 'コ', 'ガ', 'ギ', 'グ', 'ゲ', 'ゴ', 'サ', 'シ', 'ス', 'セ', 'ソ',
    'ザ','ジ', 'ズ', 'ゼ', 'ゾ', 'タ', 'チ','ツ','テ','ト','ダ','ヂ','ヅ','デ','ド','ナ','ニ','ヌ','ネ','ノ','ハ','ヒ','フ','ヘ','ホ','バ','ビ','ブ','ベ','ボ',
    'パ','ピ','プ','ペ','ポ','マ','ミ','ム','メ','モ','ヤ','ユ','ヨ','ラ','リ','ル','レ','ロ','ワ','ヲ','ン',
     }
--@TODO: save current level
M.settings = {}
M.settings.currentLevel = 1
M.settings.unlockedLevels = 9
M.settings.soundOn = true
M.settings.musicOn = true
M.modeAlphabet['hiragana'].levels = {}

M.modeAlphabet['hiragana'].levels[1]={}
M.modeAlphabet['hiragana'].levels[1].W = {'わたし','ねこ','いえ','いぬ','これ','ひと','すし'}
M.modeAlphabet['hiragana'].levels[1].W_M =
{
    {'わ', 'た', 'し', 0, 0, 0, 'い', 0, 0, 0},
    {0, 'ね', 'こ', 0, 0, 0, 'え', 0, 0, 0},
    {0, 0, 'れ', 0, 0, 0, 'じ', 0, 0, 0},
    {0, 0, 'す', 'し', 0, 0, 'ゃ', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'ひ', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'と', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'い', 'ぬ', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0}}

M.modeAlphabet['hiragana'].levels[2]={}
M.modeAlphabet['hiragana'].levels[2].W = {'きもの','かれ','ぼく','にほん','あなた','さむらい'}
M.modeAlphabet['hiragana'].levels[2].W_M =
{
    {0, 0, 'き', 0, 0, 0, 'ぼ', 0, 0, 0},
    {0, 0, 'も', 0, 0, 0, 'く', 0, 0, 0},
    {0, 0, 'の', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'か', 'れ', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {'に', 'ほ', 'ん', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 'あ'},
    {0, 0, 'さ', 'む', 'ら', 'い', 0, 0, 0, 'な'},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 'た'},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['hiragana'].levels[3]={}
M.modeAlphabet['hiragana'].levels[3].W = {'やめて','ちいさい','きいろい','すてき','はなす'}
M.modeAlphabet['hiragana'].levels[3].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 'ち', 0, 0},
    {0, 0, 0, 0, 0, 0, 'き', 'い', 'ろ', 'い'},
    {0, 0, 0, 0, 0, 0, 0, 'さ', 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 'い', 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'や', 'め', 'て', 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'す', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'て', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'き', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'は', 'な', 'す', 0, 0} }

M.modeAlphabet['hiragana'].levels[4]={}
M.modeAlphabet['hiragana'].levels[4].W = {'おおきい','おもしろい','しつれい','しんせつ','しゃしん'}
M.modeAlphabet['hiragana'].levels[4].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'し', 'ゃ', 'し', 'ん', 0, 0, 0, 0},
    {0, 0, 'ん', 0, 0, 0, 0, 0, 0, 'お'},
    {0, 0, 'せ', 0, 0, 0, 0, 0, 0, 'お'},
    {0, 0, 'つ', 0, 0, 0, 0, 0, 0, 'き'},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 'い'},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 'お', 'も', 'し', 'ろ', 'い', 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'つ', 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'れ', 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'い', 0, 0, 0, 0} }

M.modeAlphabet['hiragana'].levels[5]={}
M.modeAlphabet['hiragana'].levels[5].W = {'ちかてつ','おちゃ','めがね','りんご','かのじょ'}
M.modeAlphabet['hiragana'].levels[5].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 'お', 0, 0, 0},
    {0, 'め', 'が', 'ね', 0, 0, 'ち', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 'ゃ', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'り', 'ん', 'ご', 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'ち', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'か', 'の', 'じ', 'ょ', 0, 0, 0},
    {0, 0, 0, 'て', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'つ', 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['hiragana'].levels[6]={}
M.modeAlphabet['hiragana'].levels[6].W = {'じかん','だいがく','はなぢ','でんわ','ぼうし'}
M.modeAlphabet['hiragana'].levels[6].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'は', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'な', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'ぢ', 'で', 'ん', 'わ', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'じ', 'か', 'ん', 0, 0},
    {0, 'だ', 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 'い', 0, 'ぼ', 'う', 'し', 0, 0, 0, 0},
    {0, 'が', 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 'く', 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['hiragana'].levels[7]={}
M.modeAlphabet['hiragana'].levels[7].W = {'たべる','およぐ','あそぶ','しんせつ','とくべつ','すみません'}
M.modeAlphabet['hiragana'].levels[7].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 'た', 'べ', 'る', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 'あ', 0, 0},
    {0, 'す', 'し', 0, 0, 0, 0, 'そ', 0, 0},
    {0, 'み', 'ん', 0, 0, 0, 0, 'ぶ', 0, 0},
    {0, 'ま', 'せ', 0, 0, 0, 0, 0, 0, 0},
    {0, 'せ', 'つ', 'と', 'く', 'べ', 'つ', 0, 0, 0},
    {0, 'ん', 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'お', 'よ', 'ぐ', 0, 0, 0, 0} }

M.modeAlphabet['hiragana'].levels[8]={}
M.modeAlphabet['hiragana'].levels[8].W = {'せんしゅう','ちゅうしゃ','ちょうちょ','おりがみ','ぴあの','ありがとう'}
M.modeAlphabet['hiragana'].levels[8].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 'ぴ', 0, 0},
    {0, 0, 'お', 0, 0, 0, 0, 'あ', 0, 0},
    {0, 0, 'り', 0, 0, 0, 0, 'の', 0, 0},
    {0, 0, 'が', 0, 0, 0, 'あ', 0, 0, 0},
    {0, 0, 'み', 0, 0, 0, 'り', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 'が', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 'と', 0, 0, 0},
    {0, 0, 0, 0, 'ち', 'ょ', 'う', 'ち', 'ょ', 0},
    {0, 'せ', 'ん', 'し', 'ゅ', 'う', 0, 0, 0, 0},
    {0, 0, 0, 0, 'う', 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 'し', 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 'ゃ', 0, 0, 0, 0, 0} }

M.modeAlphabet['hiragana'].levels[9]={}
M.modeAlphabet['hiragana'].levels[9].W = {'おはよう','こんにちは','こんばんは','さよなら','がんばって','あかいくるま'}
M.modeAlphabet['hiragana'].levels[9].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 'さ', 0, 0, 0, 0, 0},
    {0, 0, 'お', 'は', 'よ', 'う', 0, 0, 0, 0},
    {0, 'あ', 0, 0, 'な', 0, 0, 0, 0, 0},
    {0, 'か', 0, 0, 'ら', 0, 0, 0, 0, 0},
    {0, 'い', 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 'く', 0, 'こ', 'ん', 'に', 'ち', 'は', 0, 0},
    {0, 'る', 'が', 'ん', 'ば', 'っ', 'て', 0, 0, 0},
    {0, 'ま', 0, 'ば', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'ん', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'は', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }
-------------------------------------------------------------
M.modeAlphabet['katakana'].levels = {}
M.modeAlphabet['katakana'].levels[1]={}
M.modeAlphabet['katakana'].levels[1].W = {'ネクタイ','ワイン','バナナ','スカート'}
M.modeAlphabet['katakana'].levels[1].W_M =
{
    {0, 0, 'ネ', 'ク', 'タ', 'イ', 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'ワ', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'イ', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'ン', 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'ス', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'カ', 0, 0, 0, 0, 'バ', 'ナ', 'ナ'},
    {0, 0, 'ー', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'ト', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['katakana'].levels[2]={}
M.modeAlphabet['katakana'].levels[2].W = {'ペン','ビール','トイレ','テント','タイ'}
M.modeAlphabet['katakana'].levels[2].W_M =
{
    {0, 0, 'テ', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'ン', 0, 'ペ', 'ン', 0, 0, 0, 0},
    {0, 0, 'ト', 'イ', 'レ', 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 'ビ', 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 'ー', 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 'ル', 0},
    {0, 0, 0, 0, 'タ', 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 'イ', 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['katakana'].levels[3]={}
M.modeAlphabet['katakana'].levels[3].W = {'ガラス','レタス','ピアノ','ワイフ','レポート'}
M.modeAlphabet['katakana'].levels[3].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 'ガ'},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 'ラ'},
    {0, 0, 'ピ', 'ア', 'ノ', 0, 0, 0, 0, 'ス'},
    {0, 0, 0, 0, 0, 0, 0, 'レ', 'タ', 'ス'},
    {'レ', 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {'ポ', 0, 'ワ', 'イ', 'フ', 0, 0, 0, 0, 0},
    {'ー', 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {'ト', 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }
M.modeAlphabet['katakana'].levels[4]={}
M.modeAlphabet['katakana'].levels[4].W = {'インド', 'シャツ', 'スーツ', 'スペイン', 'ロンドン'}
M.modeAlphabet['katakana'].levels[4].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 'イ', 0, 0},
    {0, 'ロ', 0, 0, 0, 'ス', 0, 'ン', 0, 0},
    {0, 'ン', 0, 0, 0, 'ペ', 0, 'ド', 0, 0},
    {0, 'ド', 0, 0, 0, 'イ', 0, 0, 0, 0},
    {0, 'ン', 'シ', 0, 0, 'ン', 0, 0, 0, 0},
    {0, 0, 'ャ', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'ツ', 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'ス', 'ー', 'ツ', 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['katakana'].levels[5]={}
M.modeAlphabet['katakana'].levels[5].W = {'パスポート', 'ホンコン', 'シャンパン', 'ボタン', 'ビタミン'}
M.modeAlphabet['katakana'].levels[5].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 'パ', 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 'ス', 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 'ポ', 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 'ー', 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 'ト', 0},
    {0, 0, 0, 0, 'ホ', 'ン', 'コ', 'ン', 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {'ボ', 'シ', 'ャ', 'ン', 'パ', 'ン', 0, 0, 0, 0},
    {'タ', 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {'ン', 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 'ビ', 'タ', 'ミ', 'ン', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['katakana'].levels[6]={}
M.modeAlphabet['katakana'].levels[6].W = {'モーターボート', 'ロボット', 'トルコ', 'トースター', 'ソフト'}
M.modeAlphabet['katakana'].levels[6].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 'ト', 'ル', 'コ', 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 'ロ', 0, 0, 0, 0, 0},
    {'モ', 'ー', 'タ', 'ー', 'ボ', 'ー', 'ト', 0, 0, 0},
    {0, 'ソ', 0, 0, 0, 'ッ', 0, 0, 0, 0},
    {0, 'フ', 0, 0, 0, 'ト', 'ー', 'ス', 'タ', 'ー'},
    {0, 'ト', 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['katakana'].levels[7]={}
M.modeAlphabet['katakana'].levels[7].W = {'クリスマス', 'ドラマ', 'カラオケバー', 'マイク', 'ヨーロッパ'}
M.modeAlphabet['katakana'].levels[7].W_M =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {'カ', 0, 'ヨ', 'ー', 'ロ', 'ッ', 'パ', 0, 0, 0},
    {'ラ', 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {'オ', 0, 0, 0, 'ド', 'ラ', 'マ', 0, 0, 'マ'},
    {'ケ', 0, 0, 0, 0, 0, 0, 0, 0, 'イ'},
    {'バ', 0, 0, 0, 0, 0, 0, 0, 0, 'ク'},
    {'ー', 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 'ク', 'リ', 'ス', 'マ', 'ス', 0, 0, 0, 0} }

M.modeAlphabet['katakana'].levels[8]={}
M.modeAlphabet['katakana'].levels[8].W = {'ピエ', 'オーバーコート', 'パソコン', 'スケート', 'ボクシング'}
M.modeAlphabet['katakana'].levels[8].W_M =
{
    {0, 0, 0, 0, 0, 'ピ', 'エ', 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 'オ', 0, 0, 0, 0},
    {0, 'パ', 0, 0, 0, 'ー', 0, 0, 0, 'ボ'},
    {0, 'ソ', 0, 0, 0, 'バ', 0, 0, 0, 'ク'},
    {0, 'コ', 0, 0, 0, 'ー', 0, 0, 0, 'シ'},
    {0, 'ン', 0, 0, 0, 'コ', 0, 0, 0, 'ン'},
    {0, 0, 0, 0, 0, 'ー', 0, 0, 0, 'グ'},
    {0, 0, 'ス', 'ケ', 'ー', 'ト', 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

M.modeAlphabet['katakana'].levels[9]={}
M.modeAlphabet['katakana'].levels[9].W = {'ピンポン', 'スウェーデン', 'オリンピック', 'サンドイッチ', 'サックス', 'エレベーター'}
M.modeAlphabet['katakana'].levels[9].W_M =
{
    {0, 0, 0, 0, 'エ', 'レ', 'ベ', 'ー', 'タ', 'ー'},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {'オ', 0, 'ス', 'ウ', 'ェ', 'ー', 'デ', 'ン', 0, 0},
    {'リ', 0, 'サ', 'ン', 'ド', 'イ', 'ッ', 'チ', 0, 0},
    {'ン', 0, 'ッ', 0, 0, 0, 0, 0, 0, 0},
    {'ピ', 0, 'ク', 0, 0, 0, 0, 0, 0, 0},
    {'ッ', 0, 'ス', 0, 0, 0, 0, 0, 0, 0},
    {'ク', 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 'ピ', 'ン', 'ポ', 'ン', 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} }

return M